Revit 2024 API
BuiltInFailures.TrussFailures Class
 Failures about Truss.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class TrussFailures
Visual Basic
Public NotInheritable Class TrussFailures
Visual C++
public ref class TrussFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.TrussFailures
See Also
BuiltInFailures.TrussFailures Members
Autodesk.Revit.DB Namespace